# Options Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
Options Constructor
Options Class See Also
---
Creates a default Options object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Options()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
Options()
```

# Remarks
Defaults to medium detail, no references and no view.
# See Also
Options Class
Options Overload
Autodesk.Revit.DB Namespace